#pragma once

namespace pck
{
	// packet cmd
	enum class EPacketCmd : int
	{

		// Common	---------------------------------------------------------------
		KeepAlive = 1,						// 心跳包
		LoginSrvRequest = 8,				// 登录服务端请求包
		LoginSrvResult = 9,					// 登录服务端结果包
		// Common	---------------------------------------------------------------


		// 中心服务	---------------------------------------------------------------
		ServerListen = 504,					// 服务器监听信息
		ServerListenEx = 2076,				// 服务器扩展监听信息
		// 中心服务	---------------------------------------------------------------


		None
	};
}